Acquiring state lock. This may take a few moments...
module.lambda_layer.data.archive_file.pymysql_layer: Reading...
module.lambda_layer.data.archive_file.pymysql_layer: Read complete after 0s [id=fdbcd5e1107f297ea43bc9c2c8cf137dabe8d5aa]
module.iam.aws_iam_role_policy_attachment.lambda_combined_policy_attachment: Refreshing state... [id=lambda_sql_initializer_role-20250611013918738500000001]
module.security_group.aws_security_group_rule.allow_eks_app_to_rds: Refreshing state... [id=sgrule-4275366123]
module.iam.aws_iam_role.lambda_exec_role: Refreshing state... [id=lambda_sql_initializer_role]
module.sending_news.aws_cloudwatch_event_rule.weekday_hourly_trigger: Refreshing state... [id=send-news-lambda-weekday-trigger]
module.lambda_layer.aws_lambda_layer_version.news_layer: Refreshing state... [id=arn:aws:lambda:ap-northeast-2:635140758252:layer:news_layer:2]
module.sending_news.aws_lambda_permission.allow_cloudwatch: Refreshing state... [id=AllowExecutionFromCloudWatch]
module.sending_news.aws_cloudwatch_event_target.lambda_target: Refreshing state... [id=send-news-lambda-weekday-trigger-send-news-lambda]
module.sending_news.aws_lambda_function.this: Refreshing state... [id=news-lambda-handler]
module.iam.aws_iam_policy.lambda_combined_policy: Refreshing state... [id=arn:aws:iam::635140758252:policy/lambda_combined_policy]
module.sending_news.aws_cloudwatch_log_group.lambda_logs: Refreshing state... [id=/aws/lambda/news-lambda-handler]
module.lambda_layer.aws_lambda_layer_version.pymysql: Refreshing state... [id=arn:aws:lambda:ap-northeast-2:635140758252:layer:pymysql-layer:18]
module.iam.aws_iam_role.eks_node_role: Refreshing state... [id=EKSNodeInstanceRole]
module.iam.aws_iam_policy.lambda_vpc_access_policy: Refreshing state... [id=arn:aws:iam::635140758252:policy/lambda_vpc_access_policy]
module.iam.aws_iam_role.eks_cluster_role: Refreshing state... [id=EKSClusterRole]
module.nat.aws_eip.nat_eip: Refreshing state... [id=eipalloc-063335cf456b27cf6]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-0c0901e6948ea29cc]
module.iam.aws_iam_role_policy_attachment.lambda_vpc_policy_attachment: Refreshing state... [id=lambda_sql_initializer_role-20250611004753768800000003]
module.iam.aws_iam_role_policy_attachment.ec2_container_registry_read_only: Refreshing state... [id=EKSNodeInstanceRole-20250611004753785700000004]
module.iam.aws_iam_role_policy_attachment.eks_cni: Refreshing state... [id=EKSNodeInstanceRole-20250611004753794900000005]
module.iam.aws_iam_role_policy_attachment.eks_worker_node: Refreshing state... [id=EKSNodeInstanceRole-20250611004753978500000006]
module.iam.aws_iam_role_policy_attachment.eks_cluster_attach: Refreshing state... [id=EKSClusterRole-20250611004753727200000002]
module.igw.aws_internet_gateway.this: Refreshing state... [id=igw-0fa8bc3f22219b6c8]
module.route.aws_route_table.private: Refreshing state... [id=rtb-06299e7b6ce643aa2]
module.subnet.aws_subnet.private_3b: Refreshing state... [id=subnet-0d4d3e6b773ae5851]
module.subnet.aws_subnet.public_1a: Refreshing state... [id=subnet-01a96d558015eb6a1]
module.subnet.aws_subnet.public_2c: Refreshing state... [id=subnet-0d19e1929dd0d7f7c]
module.security_group.aws_security_group.rds_sg: Refreshing state... [id=sg-019710c80979e22dd]
module.subnet.aws_subnet.private_4d: Refreshing state... [id=subnet-0f40edd62f8b96713]
module.security_group.aws_security_group.app_sg: Refreshing state... [id=sg-09792874f7ba1ae74]
module.route.aws_route_table.public: Refreshing state... [id=rtb-06bf51d5f2416dfa0]
module.eks.aws_ecr_lifecycle_policy.spring_app: Refreshing state... [id=spring-app]
module.route.aws_route_table_association.private_2: Refreshing state... [id=rtbassoc-04929efee417c39b0]
module.route.aws_route_table_association.private_1: Refreshing state... [id=rtbassoc-0c95d4d479fffa3e4]
module.nat.aws_nat_gateway.nat: Refreshing state... [id=nat-097c8f80c3303eae5]
module.eks.aws_eks_cluster.this: Refreshing state... [id=news-cluster]
module.rds.aws_db_subnet_group.this: Refreshing state... [id=news-rds]
module.route.aws_route.private_route: Refreshing state... [id=r-rtb-06299e7b6ce643aa21080289494]
module.route.aws_route_table_association.public_2: Refreshing state... [id=rtbassoc-0af0717b5aa1b6448]
module.route.aws_route_table_association.public_1: Refreshing state... [id=rtbassoc-0932b156e8efeadb6]
module.route.aws_route.public_route: Refreshing state... [id=r-rtb-06bf51d5f2416dfa01080289494]
module.eks.aws_eks_node_group.default: Refreshing state... [id=news-cluster:news-cluster-ng]
module.rds.aws_db_instance.this: Refreshing state... [id=db-63SFMXYKWZ6VP3M4NGEVLBDDXM]
module.sql_initializer.aws_lambda_function.sql_initializer: Refreshing state... [id=rds-sql-initializer]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.iam.aws_iam_policy.lambda_combined_policy will be destroyed
  # (because aws_iam_policy.lambda_combined_policy is not in configuration)
  - resource "aws_iam_policy" "lambda_combined_policy" {
      - arn              = "arn:aws:iam::635140758252:policy/lambda_combined_policy" -> null
      - attachment_count = 1 -> null
      - id               = "arn:aws:iam::635140758252:policy/lambda_combined_policy" -> null
      - name             = "lambda_combined_policy" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:CreateLogGroup",
                          - "logs:CreateLogStream",
                          - "logs:PutLogEvents",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "rds:DescribeDBInstances",
                          - "rds-data:ExecuteStatement",
                          - "rds-db:connect",
                          - "lambda:PublishLayerVersion",
                          - "lambda:Get*",
                          - "lambda:List*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "events:ListRules",
                          - "events:PutRule",
                          - "events:PutTargets",
                          - "events:RemoveTargets",
                          - "events:DeleteRule",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAZHYKW3LWC73CMVCOF" -> null
      - tags             = {} -> null
      - tags_all         = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.iam.aws_iam_policy.lambda_policy will be created
  + resource "aws_iam_policy" "lambda_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "lambda_sql_initializer_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "rds:DescribeDBInstances",
                          + "rds-data:ExecuteStatement",
                          + "rds-db:connect",
                          + "lambda:PublishLayerVersion",
                          + "lambda:Get*",
                          + "lambda:List*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.iam.aws_iam_role_policy_attachment.lambda_combined_policy_attachment will be destroyed
  # (because aws_iam_role_policy_attachment.lambda_combined_policy_attachment is not in configuration)
  - resource "aws_iam_role_policy_attachment" "lambda_combined_policy_attachment" {
      - id         = "lambda_sql_initializer_role-20250611013918738500000001" -> null
      - policy_arn = "arn:aws:iam::635140758252:policy/lambda_combined_policy" -> null
      - role       = "lambda_sql_initializer_role" -> null
    }

  # module.iam.aws_iam_role_policy_attachment.lambda_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "lambda_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "lambda_sql_initializer_role"
    }

  # module.lambda_layer.aws_lambda_layer_version.news_layer will be destroyed
  # (because aws_lambda_layer_version.news_layer is not in configuration)
  - resource "aws_lambda_layer_version" "news_layer" {
      - arn                         = "arn:aws:lambda:ap-northeast-2:635140758252:layer:news_layer:2" -> null
      - code_sha256                 = "wIpRGW27D5jnmgyaQfR3G5Q/8hapgp5NAYheqlA/MMk=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.11",
        ] -> null
      - created_date                = "2025-06-11T01:39:24.088+0000" -> null
      - filename                    = "../../modules/lambda/layer/../lambda_layer.zip" -> null
      - id                          = "arn:aws:lambda:ap-northeast-2:635140758252:layer:news_layer:2" -> null
      - layer_arn                   = "arn:aws:lambda:ap-northeast-2:635140758252:layer:news_layer" -> null
      - layer_name                  = "news_layer" -> null
      - skip_destroy                = false -> null
      - source_code_hash            = "wIpRGW27D5jnmgyaQfR3G5Q/8hapgp5NAYheqlA/MMk=" -> null
      - source_code_size            = 15247052 -> null
      - version                     = "2" -> null
        # (4 unchanged attributes hidden)
    }

  # module.lambda_layer.aws_lambda_layer_version.pymysql must be replaced
-/+ resource "aws_lambda_layer_version" "pymysql" {
      ~ arn                         = "arn:aws:lambda:ap-northeast-2:635140758252:layer:pymysql-layer:18" -> (known after apply)
      ~ code_sha256                 = "y1EHDEX0dvFIqzrK7bT34g4mmvgtY+Bn8EuyS96eTkY=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-06-11T01:39:28.507+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-northeast-2:635140758252:layer:pymysql-layer:18" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-northeast-2:635140758252:layer:pymysql-layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "y1EHDEX0dvFIqzrK7bT34g4mmvgtY+Bn8EuyS96eTkY=" -> "UsCtUjNZjqOdCFfzT/mVwAal45B1Mls0Ah7pwZx3abA=" # forces replacement
      ~ source_code_size            = 124388 -> (known after apply)
      ~ version                     = "18" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.security_group.aws_security_group.rds_sg will be updated in-place
  ~ resource "aws_security_group" "rds_sg" {
        id                     = "sg-019710c80979e22dd"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Allow EKS app access to RDS"
              - from_port        = 3306
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0f599a11149f94879",
                ]
              - self             = false
              - to_port          = 3306
            },
          - {
              - cidr_blocks      = []
              - description      = "Allow Lambda access to RDS"
              - from_port        = 3306
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-022962e707642d448",
                ]
              - self             = false
              - to_port          = 3306
            },
          - {
              - cidr_blocks      = []
              - description      = "Allow Lambda to access RDS"
              - from_port        = 3306
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-04f81fbf094fe9728",
                ]
              - self             = false
              - to_port          = 3306
            },
          - {
              - cidr_blocks      = []
              - description      = "Allow app SG access"
              - from_port        = 3306
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-09792874f7ba1ae74",
                ]
              - self             = false
              - to_port          = 3306
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow access from anywhere"
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3306
            },
        ]
        name                   = "rds-sg"
        tags                   = {
            "Name" = "rds-sg"
        }
        # (8 unchanged attributes hidden)
    }

  # module.security_group.aws_security_group_rule.allow_eks_app_to_rds will be destroyed
  # (because aws_security_group_rule.allow_eks_app_to_rds is not in configuration)
  - resource "aws_security_group_rule" "allow_eks_app_to_rds" {
      - description              = "Allow EKS app access to RDS" -> null
      - from_port                = 3306 -> null
      - id                       = "sgrule-4275366123" -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-019710c80979e22dd" -> null
      - security_group_rule_id   = "sgr-0a0ce819918441e66" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-0f599a11149f94879" -> null
      - to_port                  = 3306 -> null
      - type                     = "ingress" -> null
    }

  # module.sending_news.aws_cloudwatch_event_rule.weekday_hourly_trigger will be destroyed
  # (because aws_cloudwatch_event_rule.weekday_hourly_trigger is not in configuration)
  - resource "aws_cloudwatch_event_rule" "weekday_hourly_trigger" {
      - arn                 = "arn:aws:events:ap-northeast-2:635140758252:rule/send-news-lambda-weekday-trigger" -> null
      - description         = "Trigger Lambda every weekday at the top of the hour" -> null
      - event_bus_name      = "default" -> null
      - force_destroy       = false -> null
      - id                  = "send-news-lambda-weekday-trigger" -> null
      - is_enabled          = true -> null
      - name                = "send-news-lambda-weekday-trigger" -> null
      - schedule_expression = "cron(0 * ? * MON-FRI *)" -> null
      - state               = "ENABLED" -> null
      - tags                = {} -> null
      - tags_all            = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.sending_news.aws_cloudwatch_event_target.lambda_target will be destroyed
  # (because aws_cloudwatch_event_target.lambda_target is not in configuration)
  - resource "aws_cloudwatch_event_target" "lambda_target" {
      - arn            = "arn:aws:lambda:ap-northeast-2:635140758252:function:news-lambda-handler" -> null
      - event_bus_name = "default" -> null
      - force_destroy  = false -> null
      - id             = "send-news-lambda-weekday-trigger-send-news-lambda" -> null
      - rule           = "send-news-lambda-weekday-trigger" -> null
      - target_id      = "send-news-lambda" -> null
        # (3 unchanged attributes hidden)
    }

  # module.sending_news.aws_cloudwatch_log_group.lambda_logs will be destroyed
  # (because aws_cloudwatch_log_group.lambda_logs is not in configuration)
  - resource "aws_cloudwatch_log_group" "lambda_logs" {
      - arn               = "arn:aws:logs:ap-northeast-2:635140758252:log-group:/aws/lambda/news-lambda-handler" -> null
      - id                = "/aws/lambda/news-lambda-handler" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/lambda/news-lambda-handler" -> null
      - retention_in_days = 14 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "Name" = "Lambda Log Group"
        } -> null
      - tags_all          = {
          - "Name" = "Lambda Log Group"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.sending_news.aws_lambda_function.this will be destroyed
  # (because aws_lambda_function.this is not in configuration)
  - resource "aws_lambda_function" "this" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ap-northeast-2:635140758252:function:news-lambda-handler" -> null
      - code_sha256                    = "Wgt3I3m12LenolNYmqv4U/SkpkyKAz5WWTvI/7PYEB0=" -> null
      - filename                       = "../../modules/lambda/sending_news/lambda_function.zip" -> null
      - function_name                  = "news-lambda-handler" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "news-lambda-handler" -> null
      - invoke_arn                     = "arn:aws:apigateway:ap-northeast-2:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-2:635140758252:function:news-lambda-handler/invocations" -> null
      - last_modified                  = "2025-06-11T02:09:44.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:ap-northeast-2:635140758252:layer:pymysql-layer:18",
        ] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ap-northeast-2:635140758252:function:news-lambda-handler:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-2:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-2:635140758252:function:news-lambda-handler:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::635140758252:role/lambda_sql_initializer_role" -> null
      - runtime                        = "python3.11" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "Wgt3I3m12LenolNYmqv4U/SkpkyKAz5WWTvI/7PYEB0=" -> null
      - source_code_size               = 2329 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null
        # (6 unchanged attributes hidden)

      - environment {
          - variables = {
              - "DB_HOST"     = "news-rds.cb0ueo6m8a54.ap-northeast-2.rds.amazonaws.com"
              - "DB_NAME"     = "NewsSubscribe"
              - "DB_PASSWORD" = (sensitive value)
              - "DB_USER"     = "root"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/news-lambda-handler" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }

      - vpc_config {
          - ipv6_allowed_for_dual_stack = false -> null
          - security_group_ids          = [
              - "sg-019710c80979e22dd",
              - "sg-09792874f7ba1ae74",
            ] -> null
          - subnet_ids                  = [
              - "subnet-0d4d3e6b773ae5851",
              - "subnet-0f40edd62f8b96713",
            ] -> null
          - vpc_id                      = "vpc-0c0901e6948ea29cc" -> null
        }
    }

  # module.sending_news.aws_lambda_permission.allow_cloudwatch will be destroyed
  # (because aws_lambda_permission.allow_cloudwatch is not in configuration)
  - resource "aws_lambda_permission" "allow_cloudwatch" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "news-lambda-handler" -> null
      - id                  = "AllowExecutionFromCloudWatch" -> null
      - principal           = "events.amazonaws.com" -> null
      - source_arn          = "arn:aws:events:ap-northeast-2:635140758252:rule/send-news-lambda-weekday-trigger" -> null
      - statement_id        = "AllowExecutionFromCloudWatch" -> null
        # (2 unchanged attributes hidden)
    }

  # module.sql_initializer.data.archive_file.lambda_zip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "lambda_zip" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "../../modules/lambda/sql_initializer/sql_init.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "../../modules/lambda/sql_initializer"
      + type                = "zip"
    }

  # module.sql_initializer.aws_lambda_function.sql_initializer will be updated in-place
  ~ resource "aws_lambda_function" "sql_initializer" {
        id                             = "rds-sql-initializer"
      ~ last_modified                  = "2025-06-11T02:02:46.245+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-northeast-2:635140758252:layer:pymysql-layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "F+ZZ4d9gkV0ewo5Z/Z+pyiwI6Xoi6UuT4Dnq27bX8PU=" -> (known after apply)
        tags                           = {}
        # (26 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DB_HOST"     = "news-rds.cb0ueo6m8a54.ap-northeast-2.rds.amazonaws.com" -> "news-rds.cb0ueo6m8a54.ap-northeast-2.rds.amazonaws.com:3306"
                # (4 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 3 to add, 2 to change, 10 to destroy.

Changes to Outputs:
  - rds_endpoint = "news-rds.cb0ueo6m8a54.ap-northeast-2.rds.amazonaws.com" -> null

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

<!-- Sticky Pull Request Comment -->